# read data from a csv file

In [ ]:
import pandas as pd

In [ ]:
ex6=pd.read_csv("/content/ex6.csv")

In [ ]:
ex6

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
ex6.columns

Index(['one', 'two', 'three', 'four', 'key'], dtype='object')

In [ ]:
ex6.shape

(10000, 5)

# read data in pieces from a file

In [ ]:
chunker=pd.read_csv("/content/ex6.csv",chunksize=1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

To read data from large csv file in chunks and calculate the frequency of each unique value of column called key

In [ ]:
tot=pd.Series([],dtype='int64') #create an empty series
for piece in chunker:
  tot=tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)

In [ ]:
tot[:5]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
dtype: float64

In [ ]:
data=pd.read_csv("ex6.csv")

To store the dataframe as csv file

In [ ]:
data.to_csv("out1.csv")

# To read data from csv file using csv library

In [ ]:
import csv
f=open("ex7.csv")
reader = csv.reader(f)

In [ ]:
for line in reader:
  print(line)
f.close()

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

another way to read data from csv file

In [ ]:
with open("ex7.csv") as f:
  lines=list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [ ]:
l1=[1,2,3,4]
l2=['a','b','c','d']
r=zip(l1,l2)
type(list(r))

list

In [ ]:
header,values=lines[0], lines[1:]
print(header)
print(values)

['a', 'b', 'c']
[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [ ]:
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

Read data from json

In [ ]:
obj= """
{"name": "Anya",
"visits": ["US","Spain","Japan"],
"pet": null,
"siblings": [{"name": "Scott","age": 20,"pets": ["Zeus","Zeku"]},
             {"name": "Sara","age": 18,"pets": ["Lee","Zee"]}]
}
"""

In [ ]:
import json
result=json.loads(obj)
result

{'name': 'Anya',
 'visits': ['US', 'Spain', 'Japan'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 20, 'pets': ['Zeus', 'Zeku']},
  {'name': 'Sara', 'age': 18, 'pets': ['Lee', 'Zee']}]}

In [ ]:
jd=json.dumps(result)

In [ ]:
type(jd)

str

In [ ]:
j=open("out2.json","w")

In [ ]:
j.write(obj)
j.close()

# To read data from html file

In [ ]:
tables=pd.read_html("https://www.w3schools.com/html/html_tables.asp")
len(tables)

2

In [ ]:
type(tables)

list

In [ ]:
table=tables[0]

In [ ]:
type(table)

pandas.core.frame.DataFrame

In [ ]:
table.columns

Index(['Company', 'Contact', 'Country'], dtype='object')

In [ ]:
data=pd.read_html("fdic_failed_bank_list.html")

In [ ]:
type(data)

list

In [ ]:
data

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [ ]:
tab = data[0]
tab

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [ ]:
type(tab)

pandas.core.frame.DataFrame

In [ ]:
tab.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [ ]:
tab.dtypes

Bank Name                object
City                     object
ST                       object
CERT                      int64
Acquiring Institution    object
Closing Date             object
Updated Date             object
dtype: object

to convert the column 'Closing Date' from string to datetime object

In [ ]:
close_timestamps= pd.to_datetime(tab["Closing Date"])
type(close_timestamps)

pandas.core.series.Series

In [ ]:
close_timestamps[0]

Timestamp('2016-09-23 00:00:00')

In [ ]:
type(close_timestamps[0])

pandas._libs.tslibs.timestamps.Timestamp

to extract frequency of every year

In [ ]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [ ]:
close_timestamps.dt.month.value_counts()

7     74
4     58
10    58
1     49
2     44
8     41
5     41
3     39
9     38
6     36
11    35
12    34
Name: Closing Date, dtype: int64

In [ ]:
daate= close_timestamps.dt.date.value_counts()
daate

2009-10-30    9
2010-08-20    8
2010-04-16    8
2010-10-22    7
2009-12-18    7
             ..
2011-11-10    1
2011-10-28    1
2011-09-30    1
2011-09-09    1
2000-10-13    1
Name: Closing Date, Length: 243, dtype: int64

In [ ]:
close_timestamps.dt.day.value_counts()

23    31
30    30
19    30
20    27
17    23
16    22
4     21
18    21
7     20
15    20
14    20
2     20
24    19
27    18
11    18
22    18
28    18
21    17
29    16
26    15
5     15
13    14
10    14
8     14
6     14
25    13
12    10
9     10
31     8
1      8
3      3
Name: Closing Date, dtype: int64

To read data from xml file

In [ ]:
from lxml import objectify
path=
with open(path) as f:
  parsed=objectify.parse(f)
root=parsed.getroot()